# GetCADLinkOperations Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceServerExtensions..::..GetCADLinkOperations Method
ExternalResourceServerExtensions Class See Also
---
Gets the specific methods supported by external resource CAD Links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public CADLinkOperations GetCADLinkOperations()
```

Visual Basic
---
```text
Public Function GetCADLinkOperations As CADLinkOperations
```

Visual C++
---
```text
public:
CADLinkOperations^ GetCADLinkOperations()
```

# ### Return Value
The specific methods supported by external resource CAD Links.
# See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace